; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v8 - type_1 ?v6 - type_3)
 	      (pred_3 ?v2 - object ?v6 - type_3)
	      (pred_1 ?v8 - type_1 ?v5 - type_2)
	      (pred_4 ?v8 - type_1 ?v2 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v8 - type_1 ?v1 ?v3 - type_3)
       :precondition (and  (pred_2 ?v8 ?v1))
       :effect (and  (pred_2 ?v8 ?v3)
		     (not (pred_2 ?v8 ?v1))))

   (:action op_2
       :parameters (?v8 - type_1 ?v4 - object ?v7 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v7) (pred_2 ?v8 ?v7) (pred_1 ?v8 ?v5))
       :effect (and (pred_4 ?v8 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v7)) 
		    (not (pred_1 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_1 ?v4 - object ?v7 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v4 ?v5) (pred_2 ?v8 ?v7))
       :effect (and (pred_3 ?v4 ?v7)
		    (pred_1 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v4 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_08 - type_1
obj_06 obj_03 - type_2
obj_02 obj_07 obj_04 - type_3
obj_09 obj_05 obj_01 - object)
(:init
(pred_2 obj_08 obj_07)
(pred_1 obj_08 obj_06)
(pred_1 obj_08 obj_03)
(pred_3 obj_09 obj_04)
(pred_3 obj_05 obj_04)
(pred_3 obj_01 obj_02)
)
(:goal
(and
(pred_3 obj_09 obj_04)
(pred_3 obj_05 obj_07)
(pred_3 obj_01 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_08 ?b obj_03))))
)
)

; plan
1. (op_1 obj_08 obj_07 obj_02)
   deleted: (pred_2 obj_08 obj_07)
   added: (pred_2 obj_08 obj_02)
   goals met: 1 of 3
2. (op_2 obj_08 obj_01 obj_02 obj_06)
   deleted: (pred_3 obj_01 obj_02) (pred_1 obj_08 obj_06)
   added: (pred_4 obj_08 obj_01 obj_06)
   goals met: 1 of 3
3. (op_1 obj_08 obj_02 obj_07)
   deleted: (pred_2 obj_08 obj_02)
   added: (pred_2 obj_08 obj_07)
   goals met: 1 of 3
4. (op_3 obj_08 obj_01 obj_07 obj_06)
   deleted: (pred_4 obj_08 obj_01 obj_06)
   added: (pred_3 obj_01 obj_07) (pred_1 obj_08 obj_06)
   goals met: 2 of 3
5. (op_1 obj_08 obj_07 obj_04)
   deleted: (pred_2 obj_08 obj_07)
   added: (pred_2 obj_08 obj_04)
   goals met: 2 of 3
6. (op_2 obj_08 obj_05 obj_04 obj_06)
   deleted: (pred_3 obj_05 obj_04) (pred_1 obj_08 obj_06)
   added: (pred_4 obj_08 obj_05 obj_06)
   goals met: 2 of 3
7. (op_1 obj_08 obj_04 obj_07)
   deleted: (pred_2 obj_08 obj_04)
   added: (pred_2 obj_08 obj_07)
   goals met: 2 of 3
8. (op_3 obj_08 obj_05 obj_07 obj_06)
   deleted: (pred_4 obj_08 obj_05 obj_06)
   added: (pred_3 obj_05 obj_07) (pred_1 obj_08 obj_06)
   goals met: 3 of 3
